dannyf00/MCU-based-VU-meters/PIC24F_LCD16x2CGRAM/config.h
Emulator Pin Placement Select bits
ICS = PGx3	 Emulator functions are shared with PGEC3/PGED3
ICS = PGx2	 Emulator functions are shared with PGEC2/PGED2
ICS = PGx1	 Emulator functions are shared with PGEC1/PGED1

General Segment Write Protect
GWRP = ON	 Writes to program memory are disabled
GWRP = OFF	 Writes to program memory are allowed

General Segment Code Protect
GCP = ON	 Code protection is enabled for the entire program memory space
GCP = OFF	 Code protection is disabled

JTAG Port Enable
JTAGEN = OFF	 JTAG port is disabled
JTAGEN = ON	 JTAG port is enabled
 */

//dsPIC33FJ32GP202, dspic33fj32gp204
//dspic33fj16gp304
#elif defined(__dsPIC33FJ32GP202__) || defined(__dsPIC33FJ32GP204__) || defined(__dsPIC33FJ16GP304__)

#pragma config BWRP = WRPROTECT_OFF
#pragma config BSS = NO_BOOT_CODE
//#pragma config RBS = NO_BOOT_RAM
//#pragma config SWRP = WRPROTECT_OFF
//#pragma config SSS = NO_SEC_CODE
//#pragma config RSS = NO_SEC_RAM
#pragma config GWRP = OFF
#pragma config GSS = OFF
#pragma config FNOSC = PRI
#pragma config IESO = OFF
#pragma config POSCMD = HS
#pragma config OSCIOFNC = OFF
#pragma config IOL1WAY = OFF
#pragma config FCKSM = CSDCMD
#pragma config WDTPOST = PS32768
#pragma config WDTPRE = PR128
#pragma config WINDIS = OFF
#pragma config FWDTEN = OFF
#pragma config FPWRT = PWR128
#pragma config ALTI2C = OFF
#pragma config ICS = PGD2
#pragma config JTAGEN = OFF

/*Boot Segment Write Protect
BWRP = WRPROTECT_ON	 Boot segment is write-protected
BWRP = WRPROTECT_OFF	 Boot Segment may be written

Boot Segment Program Flash Code Protection
BSS = LARGE_FLASH_HIGH	 High Security, Large-sized Boot Flash
BSS = HIGH_LARGE_BOOT_CODE	 High Security, Large-sized Boot Flash
BSS = MEDIUM_FLASH_HIGH	 High Security, Medium-sized Boot Flash
BSS = HIGH_MEDIUM_BOOT_CODE	 High Security, Medium-sized Boot Flash
BSS = SMALL_FLASH_HIGH	 High Security, Small-sized Boot Flash
BSS = HIGH_SMALL_BOOT_CODE	 High Security, Small-sized Boot Flash
BSS = LARGE_FLASH_STD	 Standard Security, Large-sized Boot Flash
BSS = STRD_LARGE_BOOT_CODE	 Standard Security, Large-sized Boot Flash
BSS = MEDIUM_FLASH_STD	 Standard Security, Medium-sized Boot Flash
BSS = STRD_MEDIUM_BOOT_CODE	 Standard Security, Medium-sized Boot Flash
BSS = SMALL_FLASH_STD	 Standard Security, Small-sized Boot Flash
BSS = STRD_SMALL_BOOT_CODE	 Standard Security, Small-sized Boot Flash
BSS = NO_FLASH	 No Boot program Flash segment
BSS = NO_BOOT_CODE	 No Boot program Flash segment

General Code Segment Write Protect
GWRP = ON	 User program memory is write-protected
GWRP = OFF	 User program memory is not write-protected

General Segment Code Protection
GSS = HIGH	 High Security Code Protection is Enabled
GSS = ON	 Standard Security Code Protection is Enabled
GSS = OFF	 User program memory is not code-protected

Oscillator Mode
FNOSC = FRC	 Internal Fast RC (FRC)
FNOSC = FRCPLL	 Internal Fast RC (FRC) w/ PLL
FNOSC = PRI	 Primary Oscillator (XT, HS, EC)
FNOSC = PRIPLL	 Primary Oscillator (XT, HS, EC) w/ PLL
FNOSC = SOSC	 Secondary Oscillator (SOSC)
FNOSC = LPRC	 Low Power RC Oscillator (LPRC)
FNOSC = FRCDIV16	 Internal Fast RC (FRC) divide by 16
FNOSC = LPRCDIVN	 Internal Fast RC (FRC) with divide by N

Internal External Switch Over Mode
IESO = OFF	 Start-up device with user-selected oscillator source
IESO = ON	 Start-up device with FRC, then automatically switch to user-selected oscillator source when ready

Primary Oscillator Source
POSCMD = EC	 EC Oscillator Mode
POSCMD = XT	 XT Oscillator Mode
POSCMD = HS	 HS Oscillator Mode
POSCMD = NONE	 Primary Oscillator Disabled

OSC2 Pin Function
OSCIOFNC = ON	 OSC2 pin has digital I/O function
OSCIOFNC = OFF	 OSC2 pin has clock out function

Peripheral Pin Select Configuration
IOL1WAY = OFF	 Allow Multiple Re-configurations
IOL1WAY = ON	 Allow Only One Re-configuration

Clock Switching and Monitor
FCKSM = CSECME	 Both Clock Switching and Fail-Safe Clock Monitor are enabled
FCKSM = CSECMD	 Clock switching is enabled, Fail-Safe Clock Monitor is disabled
FCKSM = CSDCMD	 Both Clock Switching and Fail-Safe Clock Monitor are disabled

Watchdog Timer Postscaler
WDTPOST = PS1	 1 : 1
WDTPOST = PS2	 1 : 2
WDTPOST = PS4	 1 : 4
WDTPOST = PS8	 1 : 8
WDTPOST = PS16	 1 : 16
WDTPOST = PS32	 1 : 32
WDTPOST = PS64	 1 : 64
WDTPOST = PS128	 1 : 128
WDTPOST = PS256	 1 : 256
WDTPOST = PS512	 1 : 512
WDTPOST = PS1024	 1 : 1,024
WDTPOST = PS2048	 1 : 2,048
WDTPOST = PS4096	 1 : 4,096
WDTPOST = PS8192	 1 : 8,192
WDTPOST = PS16384	 1 : 16,384
WDTPOST = PS32768	 1 : 32,768

WDT Prescaler
WDTPRE = PR32	 1 : 32
WDTPRE = PR128	 1 : 128

Watchdog Timer Window
WINDIS = ON	 Watchdog Timer in Window mode
WINDIS = OFF	 Watchdog Timer in Non-Window mode

Watchdog Timer Enable
FWDTEN = OFF	 Watchdog timer enabled/disabled by user software
FWDTEN = ON	 Watchdog timer always enabled

POR Timer Value
FPWRT = PWR1	 Disabled
FPWRT = PWR2	 2ms
FPWRT = PWR4	 4ms
FPWRT = PWR8	 8ms
FPWRT = PWR16	 16ms
FPWRT = PWR32	 32ms
FPWRT = PWR64	 64ms
FPWRT = PWR128	 128ms

Alternate I2C pins
ALTI2C = ON	 I2C mapped to ASDA1/ASCL1 pins
ALTI2C = OFF	 I2C mapped to SDA1/SCL1 pins

Comm Channel Select
ICS = PGD3	 Communicate on PGC3/EMUC3 and PGD3/EMUD3
ICS = PGD2	 Communicate on PGC2/EMUC2 and PGD2/EMUD2
ICS = PGD1	 Communicate on PGC1/EMUC1 and PGD1/EMUD1

JTAG Port Enable
JTAGEN = OFF	 JTAG is Disabled
JTAGEN = ON	 JTAG is Enabled
*/

//dspic33fj128gp202, dspic33fj128gp204, dspic33fj128gp802, dspic33fj128gp804
//dspic33fj64gp202,  dspic33fj64gp204,  dspic33fj64gp802,  dspic33fj64gp804
//dspic33fj32gp302,  dspic33fj32gp304
#elif 	defined(__dsPIC33FJ128GP202__) || defined(__dsPIC33FJ128GP204__) || defined(__dsPIC33FJ128GP802__) || defined(__dsPIC33FJ128GP804__) || \
	defined(__dsPIC33FJ64GP202__) || defined(__dsPIC33FJ64GP204__) || defined(__dsPIC33FJ64GP802__) || defined(__dsPIC33FJ64GP804__) || \
	defined(__dsPIC33FJ32GP302__) || defined(__dsPIC33FJ32GP304__)

#pragma config BWRP = WRPROTECT_OFF
#pragma config BSS = NO_BOOT_CODE
#pragma config RBS = NO_BOOT_RAM
#pragma config SWRP = WRPROTECT_OFF
#pragma config SSS = NO_SEC_CODE
#pragma config RSS = NO_SEC_RAM
#pragma config GWRP = OFF
#pragma config GSS = OFF
#pragma config FNOSC = PRI
#pragma config IESO = OFF
#pragma config POSCMD = HS
#pragma config OSCIOFNC = OFF
#pragma config IOL1WAY = OFF
#pragma config FCKSM = CSDCMD
#pragma config WDTPOST = PS32768
#pragma config WDTPRE = PR128
#pragma config WINDIS = OFF
#pragma config FWDTEN = OFF
#pragma config FPWRT = PWR128
#pragma config ALTI2C = OFF
#pragma config ICS = PGD2
#pragma config JTAGEN = OFF

/*Boot Segment Write Protect
BWRP = WRPROTECT_ON	 Boot segment is write-protected
BWRP = WRPROTECT_OFF	 Boot Segment may be written

