dannyf00/MCU-based-VU-meters/PIC24F_LCD16x2CGRAM/config.h
Watchdog Timer Postscaler
WDTPOST = PS1	1 : 1
WDTPOST = PS2	1 : 2
WDTPOST = PS4	1 : 4
WDTPOST = PS8	1 : 8
WDTPOST = PS16	1 : 16
WDTPOST = PS32	1 : 32
WDTPOST = PS64	1 : 64
WDTPOST = PS128	1 : 128
WDTPOST = PS256	1 : 256
WDTPOST = PS512	1 : 512
WDTPOST = PS1024	1 : 1,024
WDTPOST = PS2048	1 : 2,048
WDTPOST = PS4096	1 : 4,096
WDTPOST = PS8192	1 : 8,192
WDTPOST = PS16384	1 : 16,384
WDTPOST = PS32768	1 : 32,768

WDT Prescaler
WDTPRE = PR32	1 : 32
WDTPRE = PR128	1 : 128

Watchdog Timer Window
WINDIS = ON	Watchdog Timer in Window mode
WINDIS = OFF	Watchdog Timer in Non-Window mode

Watchdog Timer Enable
FWDTEN = OFF	Watchdog timer enabled/disabled by user software
FWDTEN = ON	Watchdog timer always enabled

POR Timer Value
FPWRT = PWR1	Disabled
FPWRT = PWR2	2ms
FPWRT = PWR4	4ms
FPWRT = PWR8	8ms
FPWRT = PWR16	16ms
FPWRT = PWR32	32ms
FPWRT = PWR64	64ms
FPWRT = PWR128	128ms

Alternate I2C pins
ALTI2C = ON	I2C mapped to ASDA1/ASCL1 pins
ALTI2C = OFF	I2C mapped to SDA1/SCL1 pins

Motor Control PWM Low Side Polarity bit
LPOL = OFF	PWM module low side output pins have active-low output polarity
LPOL = ON	PWM module low side output pins have active-high output polarity

Motor Control PWM High Side Polarity bit
HPOL = OFF	PWM module high side output pins have active-low output polarity
HPOL = ON	PWM module high side output pins have active-high output polarity

Motor Control PWM Module Pin Mode bit
PWMPIN = OFF	PWM module pins controlled by PWM module at device Reset
PWMPIN = ON	PWM module pins controlled by PORT register at device Reset

Comm Channel Select
ICS = PGD3	Communicate on PGC3/EMUC3 and PGD3/EMUD3
ICS = PGD2	Communicate on PGC2/EMUC2 and PGD2/EMUD2
ICS = PGD1	Communicate on PGC1/EMUC1 and PGD1/EMUD1

JTAG Port Enable
JTAGEN = OFF	JTAG is Disabled
JTAGEN = ON	JTAG is Enabled
*/		
#else
//no header file found
#warning no device header file specified
#endif

#endif	//config__
